In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv("transaction.csv")

In [3]:
data.head()

       id  num_item  total_amount
0  906145         5         34000
1  906145         1         27000
2  906145         4         33000
3  184478         4         29000
4  394235         4         33000

In [4]:
data["id"].value_counts()

691067    5
720147    5
422265    5
670720    5
154620    5
         ..
881780    1
154471    1
480462    1
126129    1
156423    1
Name: id, Length: 64000, dtype: int64

In [8]:
data.groupby("id").mean()

        num_item  total_amount
id
100001  3.500000  26000.000000
100008  5.000000  26000.000000
100032  2.666667  20666.666667
100036  3.000000  25800.000000
100070  3.250000  21250.000000
...          ...           ...
999932  5.000000  32000.000000
999981  2.000000  22750.000000
999990  3.000000  28000.000000
999995  2.000000  27000.000000
999997  2.000000  13000.000000

[64000 rows x 2 columns]

In [10]:
data.groupby("id").describe()

       num_item                                                total_amount  \
          count      mean       std  min   25%  50%   75%  max        count
id
100001      2.0  3.500000  0.707107  3.0  3.25  3.5  3.75  4.0          2.0
100008      1.0  5.000000       NaN  5.0  5.00  5.0  5.00  5.0          1.0
100032      3.0  2.666667  2.081666  1.0  1.50  2.0  3.50  5.0          3.0
100036      5.0  3.000000  1.581139  1.0  2.00  3.0  4.00  5.0          5.0
100070      4.0  3.250000  1.500000  2.0  2.00  3.0  4.25  5.0          4.0
...         ...       ...       ...  ...   ...  ...   ...  ...          ...
999932      1.0  5.000000       NaN  5.0  5.00  5.0  5.00  5.0          1.0
999981      4.0  2.000000  0.816497  1.0  1.75  2.0  2.25  3.0          4.0
999990      3.0  3.000000  1.000000  2.0  2.50  3.0  3.50  4.0          3.0
999995      1.0  2.000000       NaN  2.0  2.00  2.0  2.00  2.0          1.0
999997      1.0  2.000000       NaN  2.0  2.00  2.0  2.00  2.0          1.0

                                                                        \
                mean           std      min      25%      50%      75%
id
100001  26000.000000   2828.427125  24000.0  25000.0  26000.0  27000.0
100008  26000.000000           NaN  26000.0  26000.0  26000.0  26000.0
100032  20666.666667   8736.894948  11000.0  17000.0  23000.0  25500.0
100036  25800.000000  11344.602241   8000.0  21000.0  32000.0  33000.0
100070  21250.000000   7932.002690  13000.0  16000.0  20500.0  25750.0
...              ...           ...      ...      ...      ...      ...
999932  32000.000000           NaN  32000.0  32000.0  32000.0  32000.0
999981  22750.000000  10078.855755   9000.0  19500.0  24500.0  27750.0
999990  28000.000000   5291.502622  22000.0  26000.0  30000.0  31000.0
999995  27000.000000           NaN  27000.0  27000.0  27000.0  27000.0
999997  13000.000000           NaN  13000.0  13000.0  13000.0  13000.0


            max
id
100001  28000.0
100008  26000.0
100032  28000.0
100036  35000.0
100070  31000.0
...         ...
999932  32000.0
999981  33000.0
999990  32000.0
999995  27000.0
999997  13000.0

[64000 rows x 16 columns]

In [12]:
data = data.head(1000)

In [13]:
data

         id  num_item  total_amount
0    906145         5         34000
1    906145         1         27000
2    906145         4         33000
3    184478         4         29000
4    394235         4         33000
..      ...       ...           ...
995  403475         2         24000
996  403475         3         34000
997  324592         5         26000
998  324592         5         16000
999  324592         3         24000

[1000 rows x 3 columns]

In [15]:
data.set_index("id", inplace=True)
# data = data.set_index("id")

In [16]:
data

        num_item  total_amount
id
906145         5         34000
906145         1         27000
906145         4         33000
184478         4         29000
394235         4         33000
...          ...           ...
403475         2         24000
403475         3         34000
324592         5         26000
324592         5         16000
324592         3         24000

[1000 rows x 2 columns]

In [17]:
data.reset_index()

         id  num_item  total_amount
0    906145         5         34000
1    906145         1         27000
2    906145         4         33000
3    184478         4         29000
4    394235         4         33000
..      ...       ...           ...
995  403475         2         24000
996  403475         3         34000
997  324592         5         26000
998  324592         5         16000
999  324592         3         24000

[1000 rows x 3 columns]

In [18]:
# data.reset_index().drop("id")
data.reset_index(drop=True)

     num_item  total_amount
0           5         34000
1           1         27000
2           4         33000
3           4         29000
4           4         33000
..        ...           ...
995         2         24000
996         3         34000
997         5         26000
998         5         16000
999         3         24000

[1000 rows x 2 columns]

In [20]:
data.groupby("id").sum().reset_index()

         id  num_item  total_amount
0    101354         8         81000
1    102658        13         98000
2    103128         4         69000
3    103308         9         53000
4    107253        11         67000
..      ...       ...           ...
336  980721        11         66000
337  982341         3         27000
338  982358         8         73000
339  990129         2         17000
340  993410        13         94000

[341 rows x 3 columns]

# 데이터 병합하기

In [33]:
dict1 = {"A": [1, 3, 5, 7, 9],
         "B": [2, 3, 4, 5, 6],
         "C": [10, 20, 30, 40, 50],
         "D": [1000, 2000, 3000, 40000, 5000]}

dict2 = {"A": [10, 30, 50, 70, 90],
         "B": [200, 300, 400, 500, 600],
         "C": [1, 2, 3, 4, 5],
         "D": [11, 22, 33, 44, 55]}

df1 = pd.DataFrame(dict1, index=[1, 2, 3, 4, 5])
df2 = pd.DataFrame(dict2, index=[6, 7, 8, 9, 10])

In [24]:
df1

   A  B   C      D
1  1  2  10   1000
2  3  3  20   2000
3  5  4  30   3000
4  7  5  40  40000
5  9  6  50   5000

In [25]:
df2

     A    B  C   D
6   10  200  1  11
7   30  300  2  22
8   50  400  3  33
9   70  500  4  44
10  90  600  5  55

In [26]:
pd.concat([df1, df2])

     A    B   C      D
1    1    2  10   1000
2    3    3  20   2000
3    5    4  30   3000
4    7    5  40  40000
5    9    6  50   5000
6   10  200   1     11
7   30  300   2     22
8   50  400   3     33
9   70  500   4     44
10  90  600   5     55

In [27]:
pd.concat([df1, df2], axis=1)

      A    B     C        D     A      B    C     D
1   1.0  2.0  10.0   1000.0   NaN    NaN  NaN   NaN
2   3.0  3.0  20.0   2000.0   NaN    NaN  NaN   NaN
3   5.0  4.0  30.0   3000.0   NaN    NaN  NaN   NaN
4   7.0  5.0  40.0  40000.0   NaN    NaN  NaN   NaN
5   9.0  6.0  50.0   5000.0   NaN    NaN  NaN   NaN
6   NaN  NaN   NaN      NaN  10.0  200.0  1.0  11.0
7   NaN  NaN   NaN      NaN  30.0  300.0  2.0  22.0
8   NaN  NaN   NaN      NaN  50.0  400.0  3.0  33.0
9   NaN  NaN   NaN      NaN  70.0  500.0  4.0  44.0
10  NaN  NaN   NaN      NaN  90.0  600.0  5.0  55.0

In [28]:
df1.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [29]:
df2.index

Int64Index([6, 7, 8, 9, 10], dtype='int64')

In [34]:
df1 = df1.reset_index(drop=True)
df2 = df2.reset_index(drop=True)

In [35]:
df1

   A  B   C      D
0  1  2  10   1000
1  3  3  20   2000
2  5  4  30   3000
3  7  5  40  40000
4  9  6  50   5000

In [36]:
pd.concat([df1, df2], axis=1)

   A  B   C      D   A    B  C   D
0  1  2  10   1000  10  200  1  11
1  3  3  20   2000  30  300  2  22
2  5  4  30   3000  50  400  3  33
3  7  5  40  40000  70  500  4  44
4  9  6  50   5000  90  600  5  55

In [54]:
dict1 = {"user_id": ["X1", "X2", "X3", "X4", "X5"],
         "A": [1, 3, 5, 7, 9],
         "B": [2, 3, 4, 5, 6],
         "C": [10, 20, 30, 40, 50],
         "D": [1000, 2000, 3000, 40000, 5000]}

dict2 = {"id": ["X1", "X2", "X3", "X4", "X6"],
         "E": [10, 30, 50, 70, 90],
         "F": [200, 300, 400, 500, 600],
         "G": [1, 2, 3, 4, 5],
         "H": [11, 22, 33, 44, 55]}

df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)

In [55]:
df1

In [49]:
df2

   id   E    F  G   H
0  X1  10  200  1  11
1  X2  30  300  2  22
2  X3  50  400  3  33
3  X4  70  500  4  44
4  X6  90  600  5  55

In [53]:
pd.merge(df1, df2, on="id", how="outer")

   id    A    B     C        D     E      F    G     H
0  X1  1.0  2.0  10.0   1000.0  10.0  200.0  1.0  11.0
1  X2  3.0  3.0  20.0   2000.0  30.0  300.0  2.0  22.0
2  X3  5.0  4.0  30.0   3000.0  50.0  400.0  3.0  33.0
3  X4  7.0  5.0  40.0  40000.0  70.0  500.0  4.0  44.0
4  X5  9.0  6.0  50.0   5000.0   NaN    NaN  NaN   NaN
5  X6  NaN  NaN   NaN      NaN  90.0  600.0  5.0  55.0

   id  A  B   C      D   E    F  G   H
0  X1  1  2  10   1000  10  200  1  11
1  X2  3  3  20   2000  30  300  2  22
2  X3  5  4  30   3000  50  400  3  33
3  X4  7  5  40  40000  70  500  4  44
4  X5  9  6  50   5000  90  600  5  55

In [ ]:
dict1 = {"user_id": ["X1", "X2", "X3", "X4", "X5"],
         "A": [1, 3, 5, 7, 9],
         "B": [2, 3, 4, 5, 6],
         "C": [10, 20, 30, 40, 50],
         "D": [1000, 2000, 3000, 40000, 5000]}

dict2 = {"id": ["X1", "X2", "X3", "X4", "X6"],
         "E": [10, 30, 50, 70, 90],
         "F": [200, 300, 400, 500, 600],
         "G": [1, 2, 3, 4, 5],
         "H": [11, 22, 33, 44, 55]}

df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2, index=["a", "b", "c", "d", "e"])